app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "I just created my first real micro post!"], ["created_at", Fri, 08 Aug 2014 03:13:28 UTC +00:00], ["updated_at", Fri, 08 Aug 2014 03:13:28 UTC +00:00], ["user_id", 1]]
---
	def create
		@micropost = current_user.microposts.build(microposts_params)
		if @micropost.save